package com.example.bbudaesik.utils

object BuildingInfo {

    /** 식당 코드 */
    val restaurantCodes = mapOf(
        "금정회관교직원식당" to "PG001",
        "금정회관학생식당" to "PG002",
        "샛벌회관식당" to "PS001",
        "학생회관학생식당" to "PH002",
        "학생회관밀양학생식당" to "M001",
        "학생회관밀양교직원식당" to "M002",
        "편의동2층양산식당" to "Y001"
    )
    val AppWidgetResMap = mapOf(
        "금정회관 교직원" to "PG001",
        "금정회관 학생" to "PG002",
        "샛벌회관" to "PS001",
        "편의동 2층" to "Y001",
        "학생회관 학생" to "PH002",
        "학생회관(밀양) 교직원" to "M002",
        "학생회관(밀양) 학생" to "M001",
        "진리관" to "2",
        "웅비관" to "11",
        "자유관" to "13",
        "비마관" to "3",
        "행림관" to "12",
    )


    val restaurantMap = mapOf(
        0 to listOf("PG002", "PG001", "PS001", "PH002"),//"금정회관 학생 식당", "금정회관 교직원 식당", "샛벌회관 식당", "학생회관 학생 식당"
        1 to listOf("M001", "M002"),//"학생회관(밀양) 학생 식당", "학생회관(밀양) 교직원 식당"
        2 to listOf("Y001")//"편의동2층(양산)
    )

    val dormitoryResMap = mapOf(
        0 to listOf("2", "11", "13"),// 진리관 2 웅비관 11 자유관 13
        1 to listOf("3"), // 비마관 3
        2 to listOf("12") // 행림관 12
    )

    val resCodeToNm = mapOf(
        "PG001" to "금정회관 교직원식당",
        "PG002" to "금정회관 학생식당",
        "PS001" to "샛벌회관식당",
        "PH002" to "학생회관 학생식당",
        "M001" to "학생회관(밀양) 학생식당",
        "M002" to "학생회관(밀양) 교직원식당",
        "Y001" to "편의동2층(양산)식당"
    )

    val regionRestaurants = mapOf(
        "부산" to listOf("금정회관학생식당", "금정회관교직원식당", "샛벌회관식당"),
        "밀양" to listOf("학생회관밀양학생식당", "학생회관밀양교직원식당"),
        "양산" to listOf("편의동2층양산식당")
    )

    val resNmToCode = mapOf(
        "금정회관 교직원" to "PG001",
        "금정회관학생식당" to "PG002",
        "샛벌회관식당" to "PS001",
        "학생회관학생식당" to "PH002",
        "학생회관밀양학생식당" to "M001",
        "학생회관밀양교직원식당" to "M002",
        "편의동2층양산식당" to "Y001"
    )
    /** 기숙사 코드 */
    val regionDormitories = mapOf(
        "진리관" to "2",
        "웅비관" to "11",
        "자유관" to "13",
        "비마관" to "3",
        "행림관" to "12"
    )

    val dorNoToNm = mapOf(
        "2" to "진리관",
        "11" to "웅비관",
        "13" to "자유관",
        "3" to "비마관",
        "12" to "행림관"
    )

    /** 캠퍼스 위치 */
    val campusLocations = mapOf(
        "금정회관교직원식당" to "부산",
        "금정회관학생식당" to "부산",
        "샛벌회관식당" to "부산",
        "학생회관학생식당" to "부산",
        "진리관" to "부산",
        "웅비관" to "부산",
        "자유관" to "부산",
        "학생회관밀양학생식당" to "밀양",
        "학생회관밀양교직원식당" to "밀양",
        "비마관" to "밀양",
        "편의동2층양산식당" to "양산",
        "행림관" to "양산"
    )

    /** 메뉴 시간 코드 */
    val menuTimeCodes = mapOf(
        "01" to "조기",
        "02" to "조식",
        "B" to "조식",
        "03" to "중식",
        "L" to "중식",
        "04" to "석식",
        "D" to "석식"
    )

    /** 식당 이름 (짧은 형태) */
    val shortRestaurantNames = mapOf(
        "금정회관교직원식당" to "금정 교직원",
        "금정회관학생식당" to "금정 학생",
        "샛벌회관식당" to "샛벌회관",
        "학생회관학생식당" to "학생회관",
        "학생회관밀양학생식당" to "밀양 학생",
        "학생회관밀양교직원식당" to "밀양 교직원",
        "편의동2층양산식당" to "편의동"
    )

    /** 식당 이름 (전체) */
    val fullRestaurantNames = mapOf(
        "금정회관교직원식당" to "금정회관 교직원 식당",
        "금정회관학생식당" to "금정회관 학생 식당",
        "샛벌회관식당" to "샛벌회관 식당",
        "학생회관학생식당" to "학생회관 학생 식당",
        "학생회관밀양학생식당" to "학생회관(밀양) 학생 식당",
        "학생회관밀양교직원식당" to "학생회관(밀양) 교직원 식당",
        "편의동2층양산식당" to "편의동2층(양산) 식당"
    )
}
